# SQLite3

https://docs.python.org/3/library/sqlite3.html

In [20]:
# Import SQLite3
import sqlite3

# Import pandas
import pandas as pd

In [2]:
# Create and connect to a file path for the database
con = sqlite3.connect('data/example_database.db')

In [3]:
# Create a cursor to the database
cur = con.cursor()

In [4]:
# Create a table with two columns of type text
cur.execute('CREATE TABLE person(name text, address text)')

# Save the table
con.commit()

In [5]:
# Show tables
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")
cur.fetchall()

[('person',)]

In [6]:
# Insert data into the database
cur.execute("INSERT INTO person VALUES('Anna Henry', 'Carlow')")
con.commit()

In [7]:
# Display data in table
cur.execute("SELECT * FROM person")
cur.fetchall()

[('Anna Henry', 'Carlow')]

In [8]:
# To create several entries, create array of entries
person = [('Shelby Beck', 'Tipperary'), ('Marie Carr', 'Kerry'), ('Sarah Heath', 'Monaghan')]
person

[('Shelby Beck', 'Tipperary'),
 ('Marie Carr', 'Kerry'),
 ('Sarah Heath', 'Monaghan')]

In [9]:
# Run cursor with executemany() to insert array of records
cur.executemany("INSERT INTO person VALUES(?, ?)", person)
con.commit()

In [10]:
# Display data in table
cur.execute("SELECT * FROM person")
cur.fetchall()

[('Anna Henry', 'Carlow'),
 ('Shelby Beck', 'Tipperary'),
 ('Marie Carr', 'Kerry'),
 ('Sarah Heath', 'Monaghan')]

In [11]:
# If entering a duplicate value: 
cur.execute("INSERT INTO person VALUES('Anna Henry', 'Carlow')")
con.commit()

In [12]:
# SQLite3 adds a row id to each record as a unique identifier meaning that duplicate entries can be made
cur.execute("SELECT ROWID, name, address FROM person")
cur.fetchall()

[(1, 'Anna Henry', 'Carlow'),
 (2, 'Shelby Beck', 'Tipperary'),
 (3, 'Marie Carr', 'Kerry'),
 (4, 'Sarah Heath', 'Monaghan'),
 (5, 'Anna Henry', 'Carlow')]

In [13]:
# Deleting a record
cur.execute("DELETE FROM person WHERE ROWID = 1")
con.commit()

In [14]:
# Display records
cur.execute("SELECT ROWID, name, address FROM person")
cur.fetchall()

[(2, 'Shelby Beck', 'Tipperary'),
 (3, 'Marie Carr', 'Kerry'),
 (4, 'Sarah Heath', 'Monaghan'),
 (5, 'Anna Henry', 'Carlow')]

In [15]:
# Insert data into the database
cur.execute("INSERT INTO person VALUES('Robert Snyder', 'Leitrim')")
con.commit()

In [16]:
# Display records
cur.execute("SELECT ROWID, name, address FROM person")
cur.fetchall()

[(2, 'Shelby Beck', 'Tipperary'),
 (3, 'Marie Carr', 'Kerry'),
 (4, 'Sarah Heath', 'Monaghan'),
 (5, 'Anna Henry', 'Carlow'),
 (6, 'Robert Snyder', 'Leitrim')]

<br>

## Deleting a table

In [17]:
# Delete table created above
#cur.execute("DROP TABLE person")
#con.commit()

In [18]:
# Show tables
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")
cur.fetchall()

[('person',)]

<br>

## SQLite3 with Pandas

In [54]:
# Read in data from a csv file
driver = pd.read_csv('data/driver.csv')
driver

   ID                 Name    Address
0   0           Anna Henry     Carlow
1   1          Shelby Beck  Tipperary
2   2           Marie Carr      Kerry
3   3          Sarah Heath   Monaghan
4   4        Robert Snyder    Leitrim
5   5           Lucas Ross       Cork
6   6            David Cox    Leitrim
7   7         Jackson Dean      Louth
8   8  Elizabeth Mcfarland     Dublin
9   9     Timothy Cummings   Limerick

In [55]:
# Take data from csv file and create a new sqlite3 table called driver
driver.to_sql("driver", con)

In [56]:
# View driver data
cur.execute("SELECT * FROM driver")
cur.fetchall()

[(0, 0, 'Anna Henry', 'Carlow'),
 (1, 1, 'Shelby Beck', 'Tipperary'),
 (2, 2, 'Marie Carr', 'Kerry'),
 (3, 3, 'Sarah Heath', 'Monaghan'),
 (4, 4, 'Robert Snyder', 'Leitrim'),
 (5, 5, 'Lucas Ross', 'Cork'),
 (6, 6, 'David Cox', 'Leitrim'),
 (7, 7, 'Jackson Dean', 'Louth'),
 (8, 8, 'Elizabeth Mcfarland', 'Dublin'),
 (9, 9, 'Timothy Cummings', 'Limerick')]

In [29]:
# Read in car data from csv file
car = pd.read_csv("data/car.csv")
car.to_sql("car", con)

In [36]:
# View car data
cur.execute("SELECT * FROM car")
cur.fetchall()

[(0, '08-SO-11072', 6),
 (1, '16-KE-16368', 1),
 (2, '08-LD-16871', 8),
 (3, '11-KY-17442', 4),
 (4, '16-LD-17545', 5),
 (5, '10-WH-3543', 0),
 (6, '03-KE-8148', 9),
 (7, '06-G-23024', 2),
 (8, '08-LS-21770', 7),
 (9, '03-WX-41717', 3)]

In [43]:
# Read in county data from csv file
county = pd.read_csv("data/county.csv")
county.to_sql("county", con)

In [44]:
# View county data
cur.execute("SELECT * FROM county")
cur.fetchall()

[(0, 'C', 'Cork'),
 (1, 'CE', 'Clare'),
 (2, 'CN', 'Cavan'),
 (3, 'CW', 'Carlow'),
 (4, 'D', 'Dublin'),
 (5, 'DL', 'Donegal'),
 (6, 'G', 'Galway'),
 (7, 'KE', 'Kildare'),
 (8, 'KK', 'Kilkenny'),
 (9, 'KY', 'Kerry'),
 (10, 'L', 'Limerick City'),
 (11, 'LD', 'Longford'),
 (12, 'LH', 'Louth'),
 (13, 'LK', 'County Limerick'),
 (14, 'LM', 'Leitrim'),
 (15, 'LS', 'Laois'),
 (16, 'MH', 'Meath'),
 (17, 'MN', 'Monaghan'),
 (18, 'MO', 'Mayo'),
 (19, 'OY', 'Offaly'),
 (20, 'SO', 'Sligo'),
 (21, 'RN', 'Roscommon'),
 (22, 'TN', 'Tipperary North'),
 (23, 'TS', 'Tipperary South'),
 (24, 'W', 'Waterford City'),
 (25, 'WD', 'County Waterford'),
 (26, 'WH', 'Westmeath'),
 (27, 'WX', 'Wexford'),
 (28, 'WW', 'Wicklow')]

In [46]:
# Show all tables
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")
cur.fetchall()

[('person',), ('driver',), ('car',), ('county',)]

In [60]:
# Joining tables
cur.execute("""
    SELECT d.Name, c.Registration, d.Address
    FROM driver as d JOIN car as c ON d.ID = c.OwnerId
    """)
cur.fetchall()

[('Anna Henry', '10-WH-3543', 'Carlow'),
 ('Shelby Beck', '16-KE-16368', 'Tipperary'),
 ('Marie Carr', '06-G-23024', 'Kerry'),
 ('Sarah Heath', '03-WX-41717', 'Monaghan'),
 ('Robert Snyder', '11-KY-17442', 'Leitrim'),
 ('Lucas Ross', '16-LD-17545', 'Cork'),
 ('David Cox', '08-SO-11072', 'Leitrim'),
 ('Jackson Dean', '08-LS-21770', 'Louth'),
 ('Elizabeth Mcfarland', '08-LD-16871', 'Dublin'),
 ('Timothy Cummings', '03-KE-8148', 'Limerick')]

In [61]:
# Close the connection
con.close()